run/codeValidation/timeConsistent/fsi/fsiBody3/base/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        nFaces          800;
        startFace       760;
    }
    inside
    {
        type            Unspecified;
        nFaces          40;
        startFace       1560;
    }
    outside
    {
        type            wall;
        nFaces          40;
        startFace       1600;
    }
)

// ************************************************************************* //
